# Bank Customers Clustering Analysis

## Import libraries

In [1]:
import numpy as np
import pandas as pd
import datetime
from datetime import date, timedelta
#for visualization
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

from sklearn.preprocessing import StandardScaler

 ## Load data

In [2]:
dataset = pd.read_csv(r'bank_transactions.csv')
dataset.head()
#print(dataset)

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

## Data cleaning

In [3]:
all_types = dataset.dtypes
print(all_types)
print("%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%")
print(dataset.isnull().sum())
print("%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%")
dataset[dataset.isnull().any(axis=1)]

TransactionID               object
CustomerID                  object
CustomerDOB                 object
CustGender                  object
CustLocation                object
CustAccountBalance         float64
TransactionDate             object
TransactionTime              int64
TransactionAmount (INR)    float64
dtype: object
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
29,T30,C8736958,19/12/86,M,GRAM PANCHAYTH HYDERABAD,NaN,3/8/16,160636,2600.0
176,T177,C5698953,1/1/1800,NaN,NAVI MUMBAI,8512.28,12/8/16,155727,3449.0
222,T223,C9022645,NaN,M,BHIWANDI,1730.30,21/10/16,150814,4000.0
1271,T1272,C2314972,29/7/93,M,THANE,NaN,21/10/16,203227,53.0
1495,T1496,C2515550,NaN,M,NEW DELHI,384.07,21/10/16,193326,2800.0
...,...,...,...,...,...,...,...,...,...
1047762,T1047763,C3827041,NaN,M,PUNE,91.36,18/9/16,193122,284.0
1047919,T1047920,C2427054,NaN,M,PUNE,91.36,18/9/16,201925,365.0
1048048,T1048049,C1927213,25/4/80,M,SALEM,NaN,18/9/16,82422,2200.0
1048152,T1048153,C8138543,NaN,F,REIS MAGOS BARDEZ,2630.67,18/9/16,181307,252.0
1048472,T1048473,C1242585,NaN,M,NEW DELHI,1290777.41,18/9/16,175303,8921.0

In [4]:
dataset = dataset.dropna(subset = ['CustomerDOB','CustGender', 'CustLocation', 'CustAccountBalance'], how = 'any', inplace=False)
print(dataset) # 1048567-6953 rows 

print("%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%")
print(dataset.isnull().sum())  #check that there are no more null values

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1041614 rows x 9 columns]
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
dtype: int64

In [5]:
#count values in the column 'CustomerDOB'. There is a default date of birth when the real age is missing (1/1/1800).
print(dataset['CustomerDOB'].value_counts())

#we remove rows which contain this value
dataset = dataset.drop(dataset[dataset['CustomerDOB'] == '1/1/1800'].index,axis = 0)  

dataset["CustomerDOB"] = pd.to_datetime(dataset["CustomerDOB"])
print(dataset['CustomerDOB'].dtype)

print(dataset) #985322 rows x 9 columns now

1/1/1800    56292
1/1/89        809
1/1/90        784
6/8/91        698
1/1/91        665
            ...
2/12/51         1
20/3/52         1
26/9/47         1
4/10/41         1
24/10/44        1
Name: CustomerDOB, Length: 17233, dtype: int64
datetime64[ns]
        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053  1994-10-01          F     JAMSHEDPUR
1                  T2   C2142763  2057-04-04          M        JHAJJAR
2                  T3   C4417068  1996-11-26          F         MUMBAI
3                  T4   C5342380  1973-09-14          F         MUMBAI
4                  T5   C9031234  1988-03-24          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229  1990-08-04          M      NEW DELHI
1048563      T1048564   C6459278  1992-02-20          M         NASHIK
1048564      T1048565   C6412354  1989-05-18          M      HYDERABAD
1048565      T1048566   C6420483  1978-08-30          M  VISAKHAPATNAM
1048566      T1048567   C8337524  1984-05-03          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[985322 rows x 9 columns]

In [6]:
#remove 100 years where date is greater than date of the transaction (2016 for all records) or the person is less than 10 years old

#today = datetime.today().strftime('%Y-%m-%d') get today's date in this format
#print(today)
#dataset['todayVector'] = pd.to_datetime(today)
#print(dataset['todayVector'])
  
dataset['TransactionDate'] = pd.to_datetime(dataset['TransactionDate']) #convert to datetime
filtered_data = dataset[dataset['TransactionDate'].dt.year!=2016]
print(filtered_data)  #to verify that there are no records in this new dataset (all transaction were made in 2016)

#dataset['CustomerDOB'].mask(dataset['CustomerDOB'].dt.strftime('%Y') >= dataset['todayVector'].dt.strftime('%Y'), dataset['CustomerDOB'] - pd.DateOffset(years = 100) , inplace=True )

#If person has less than 10 years there is a mistake: we have to subtract 100 years also in this case.
#dataset['CustomerDOB'].mask((dataset['CustomerDOB'] - today < 10, dataset['CustomerDOB'] - pd.DateOffset(years = 100) , inplace=True )


#remove 100 years where date is greater than date of the transaction
dataset['CustomerDOB'].mask(dataset['CustomerDOB'].dt.year >= dataset['TransactionDate'].dt.year, dataset['CustomerDOB'] - pd.DateOffset(years = 100) , inplace=True )



#dataset['CustomerDOB'].mask((dataset['CustomerDOB'] - dataset['todayVector'])/ np.timedelta64(1, 'Y') < '18', dataset['CustomerDOB'] - pd.DateOffset(years = 100) , inplace=True )


#remove 100 years if the person is less than 10 years old
dataset['CustomerDOB'].mask(dataset['TransactionDate'].dt.year - dataset['CustomerDOB'].dt.year < 10 , dataset['CustomerDOB'] - pd.DateOffset(years = 100) , inplace=True )

#df['end_date'] - df['start_date']) / np.timedelta64(1, 'D')

#dataset['CustomerAGE'] = dataset['CustomerDOB'].apply(lambda x: (today - x).days // 365)

#create a CustomerAGE column in the dataset
dataset['CustomerAGE'] = dataset['TransactionDate']- dataset['CustomerDOB']
print(dataset['CustomerAGE'].dtype) #timedelta64[ns]

#to get only the year (as an integer number)
dataset['CustomerAGE'] = dataset['CustomerAGE'].astype('timedelta64[Y]').astype('int')
dataset.head()

Empty DataFrame
Columns: [TransactionID, CustomerID, CustomerDOB, CustGender, CustLocation, CustAccountBalance, TransactionDate, TransactionTime, TransactionAmount (INR)]
Index: []
timedelta64[ns]

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR),CustomerAGE
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,143207,25.0,21
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,2016-02-08,141858,27999.0,58
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,142712,459.0,19
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,142714,2060.0,42
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,181156,1762.5,27

In [7]:
filtered_data = dataset[(dataset['CustomerDOB'].dt.year == 2000)] 
print(filtered_data) #269 rows


filtered_data = dataset[(dataset['CustomerAGE'] < 16)] #to see how many people between 16 and 10 years are left (2000-2006)
print(filtered_data)

#we consider that this is the real age because it is unlikely that they are more than 110 years old

        TransactionID CustomerID CustomerDOB CustGender CustLocation  \
734              T735   C1537725  2000-01-13          M    NEW DELHI
6966            T6967   C1911373  2000-11-04          M          PEN
7677            T7678   C1441125  2000-09-15          M       MUMBAI
8090            T8091   C5842760  2000-12-09          M  NAVI MUMBAI
8947            T8948   C6927025  2000-04-10          F      CHENNAI
...               ...        ...         ...        ...          ...
1025174      T1025175   C7840585  2000-07-02          M         PUNE
1028878      T1028879   C5315956  2000-11-16          F       MUMBAI
1033054      T1033055   C5121063  2000-09-09          M         AGRA
1035639      T1035640   C9022891  2000-09-18          M    NEW DELHI
1039268      T1039269   C4841383  2000-09-04          M         PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
734                  854.89      2016-10-21           223056
6966                2687.63      2016-09-25           134802
7677                5561.85      2016-09-27           181954
8090               10446.17      2016-09-25           200643
8947                  63.96      2016-09-27           183518
...                     ...             ...              ...
1025174            35653.29      2016-09-13           160558
1028878              125.72      2016-09-13           171936
1033054            11187.67      2016-09-18           163637
1035639           413680.87      2016-09-18           171229
1039268             4371.99      2016-09-18           144924

         TransactionAmount (INR)  CustomerAGE
734                        275.0           16
6966                        60.0           15
7677                      1225.0           16
8090                       620.0           15
8947                       694.0           16
...                          ...          ...
1025174                   1000.0           16
1028878                    190.0           15
1033054                    819.0           16
1035639                    500.0           16
1039268                    120.0           16

[269 rows x 10 columns]
        TransactionID CustomerID CustomerDOB CustGender CustLocation  \
485              T486   C8013820  2004-12-07          F      CHENNAI
3696            T3697   C1934386  2002-09-12          M    NEW DELHI
5920            T5921   C7424249  2001-04-03          M    BANGALORE
6714            T6715   C7828452  2002-08-20          M     AMRITSAR
6966            T6967   C1911373  2000-11-04          M          PEN
...               ...        ...         ...        ...          ...
1044338      T1044339   C6822618  2001-11-07          F        PATNA
1045058      T1045059   C3422655  2001-11-07          F        PATNA
1045119      T1045120   C8943140  2002-07-17          F         AGRA
1045629      T1045630   C8010686  2005-08-15          F      GURGAON
1046676      T1046677   C2722682  2001-11-07          F        PATNA

         CustAccountBalance TransactionDate  TransactionTime  \
485                 6661.03      2016-10-21           215149
3696               51469.13      2016-10-21           171357
5920                4550.32      2016-09-23           133547
6714                2458.12      2016-09-26           232151
6966                2687.63      2016-09-25           134802
...                     ...             ...              ...
1044338            92052.93      2016-09-18           103104
1045058            92052.93      2016-09-18            80219
1045119             9315.13      2016-09-18             3547
1045629            43573.32      2016-09-18           113411
1046676            92052.93      2016-09-18           103222

         TransactionAmount (INR)  CustomerAGE
485                        110.0           11
3696                       963.0           14
5920                      1197.4           15
6714                        50.0           14
6966                        60.0           15
...                          ...          ...
1044338                   5884.0           14
1045058                    368.0           14
1045119                    600.0           14
1045629                    902.0           11
1046676                   5884.0           14

[550 rows x 10 columns]

In [8]:
#dataset['TransactionTime'] = dataset['TransactionTime'].astype('string')
#from datetime import datetime as dt

#from "AABBCC" to "AA:BB:CC"
#dataset['TransactionTime'] = dataset['TransactionTime'].str.replace(r'(\w{2}(?!$))', r'\1:', regex=True)

#print(dataset['TransactionTime'])

In [9]:
#dataset["TransactionTime"] = pd.to_datetime(dataset["TransactionTime"],format= '%H:%M:%S' ).dt.time
#dataset["TransactionTime"] = pd.datetime(dataset["TransactionTime"])

In [10]:
dataset.drop('TransactionTime', inplace=True, axis=1)  #Unix format (It measures time by the number of seconds that have elapsed since 00:00:00 UTC on 1 January 1970)
print(dataset)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053  1994-10-01          F     JAMSHEDPUR
1                  T2   C2142763  1957-04-04          M        JHAJJAR
2                  T3   C4417068  1996-11-26          F         MUMBAI
3                  T4   C5342380  1973-09-14          F         MUMBAI
4                  T5   C9031234  1988-03-24          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229  1990-08-04          M      NEW DELHI
1048563      T1048564   C6459278  1992-02-20          M         NASHIK
1048564      T1048565   C6412354  1989-05-18          M      HYDERABAD
1048565      T1048566   C6420483  1978-08-30          M  VISAKHAPATNAM
1048566      T1048567   C8337524  1984-05-03          M           PUNE

         CustAccountBalance TransactionDate  TransactionAmount (INR)  \
0                  17819.05      2016-02-08                     25.0
1                   2270.69      2016-02-08                  27999.0
2                  17874.44      2016-02-08                    459.0
3                 866503.21      2016-02-08                   2060.0
4                   6714.43      2016-02-08                   1762.5
...                     ...             ...                      ...
1048562             7635.19      2016-09-18                    799.0
1048563            27311.42      2016-09-18                    460.0
1048564           221757.06      2016-09-18                    770.0
1048565            10117.87      2016-09-18                   1000.0
1048566            75734.42      2016-09-18                   1166.0

         CustomerAGE
0                 21
1                 58
2                 19
3                 42
4                 27
...              ...
1048562           26
1048563           24
1048564           27
1048565           38
1048566           32

[985322 rows x 9 columns]

In [11]:
all_types = dataset.dtypes
print(all_types) 
dataset.head()

TransactionID                      object
CustomerID                         object
CustomerDOB                datetime64[ns]
CustGender                         object
CustLocation                       object
CustAccountBalance                float64
TransactionDate            datetime64[ns]
TransactionAmount (INR)           float64
CustomerAGE                         int32
dtype: object

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionAmount (INR),CustomerAGE
0,T1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,25.0,21
1,T2,C2142763,1957-04-04,M,JHAJJAR,2270.69,2016-02-08,27999.0,58
2,T3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,459.0,19
3,T4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,2060.0,42
4,T5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,1762.5,27

In [12]:
dataset['TransactionID'] = dataset['TransactionID'].replace({'T' : ''}, regex=True)
dataset['TransactionID'] = dataset['TransactionID'].astype(int)
dataset['TransactionID'].is_unique #True, so we use this field as index

True

In [13]:
dataset = dataset.set_index('TransactionID')
dataset.head()
#print(dataset)

,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionAmount (INR),CustomerAGE
TransactionID,,,,,,,,
1,C5841053,1994-10-01,F,JAMSHEDPUR,17819.05,2016-02-08,25.0,21
2,C2142763,1957-04-04,M,JHAJJAR,2270.69,2016-02-08,27999.0,58
3,C4417068,1996-11-26,F,MUMBAI,17874.44,2016-02-08,459.0,19
4,C5342380,1973-09-14,F,MUMBAI,866503.21,2016-02-08,2060.0,42
5,C9031234,1988-03-24,F,NAVI MUMBAI,6714.43,2016-02-08,1762.5,27

## Data Visualization